# 데이터분석과 시각화

## *인공지능융합학부* ` 20226744학번 ` **박제현**

### 10월 14일 수업 강의 내용"

In [1]:
sub_list = ['math', 'english', 'science', 'history']
score_list = [87, 94, 85, 92]
Fscore_list = [i + 4 for i in score_list]

In [2]:
sem_dic = {'subjct': sub_list, 'M_scr': score_list, 'F_scr': Fscore_list}

In [3]:
import pandas as pd

df1 = pd.DataFrame(sem_dic)
df1

    subjct  M_scr  F_scr
0     math     87     91
1  english     94     98
2  science     85     89
3  history     92     96

In [4]:
df2 = pd.DataFrame([score_list, Fscore_list], index = ['M_scr', 'F_scr'], columns = sub_list)
df2

       math  english  science  history
M_scr    87       94       85       92
F_scr    91       98       89       96

In [7]:
# math와 science 두개로 이루어진 데이터프레임 가져오기

df2[['math', 'science']]

       math  science
M_scr    87       85
F_scr    91       89

In [8]:
# science의 M_scr을 84점으로 바꾸기

df2['science'][0] = 84
#df2['science']['M_scr'] = 84
df2

       math  english  science  history
M_scr    87       94       84       92
F_scr    91       98       89       96

In [9]:
# 인덱스에 새로운 요소들 추가

df2.reset_index(inplace = True)
#reset_index는 매개변수를 주지 않으면 range index가 기본으로 들어간다.
df2

   index  math  english  science  history
0  M_scr    87       94       84       92
1  F_scr    91       98       89       96

In [10]:
# 인덱스 이름만 바꾸기

df2.rename(columns = {'index': 'sem'}, inplace = True)
df2

     sem  math  english  science  history
0  M_scr    87       94       84       92
1  F_scr    91       98       89       96

In [11]:
# sem을 다시 초기화하기

df2.set_index('sem', inplace = True)
df2

       math  english  science  history
sem
M_scr    87       94       84       92
F_scr    91       98       89       96

In [ ]:
# del df2['mean']
df2['mean'] = (df2['math'] + df2['english'] + df2['science'] + df2['history']) / (len(df2.columns) - 1)
# df2.assign(mean = (df2['math'] + df2['english'] + df2['science'] + df2['history']) / len(df2.columns))
df2

In [ ]:
# df2['grade'] = ''
# for i in range(len(df2)):
#     if df2['mean'][i] >= 90:
#         df2['grade'][i] = 'A'
#     elif df2['mean'][i] >= 80:
#         df2['grade'][i] = 'B'
#     elif df2['mean'][i] >= 70:
#         df2['grade'][i] = 'C'
#     elif df2['mean'][i] >= 60:
#         df2['grade'][i] = 'D'
#     else:
#         df2['grade'][i] = 'F'
# df2

import numpy as np

df2['grade'] = np.where(df2['mean'] >= 90, 'A+', 'B+')
df2

In [ ]:
test = df2.loc['M_scr'] + df2.loc['F_scr']
test

In [ ]:
#  grade 삭제

from copy import deepcopy
df2_test = deepcopy(df2)
df2_test.drop(columns = 'grade', inplace = True)
df2_test

In [ ]:
# 과목별 평균

df2.index

In [ ]:
df2_test.mean(axis = 'index')

In [ ]:
df2.rename(index = {'M_scr': '중간', 'F_scr': '기말'}, inplace = True)
df2

In [ ]:
df2.sort_index(ascending = False, inplace = True)
df2

In [ ]:
df2.loc['mean'] = df2.mean()
df2

In [ ]:
df2.sort_values('math', ascending = False, inplace = True)
df2

In [ ]:
del df2['grade']
df2.loc['grade'] = np.where(df2.loc['mean'] >= 95, 'A+', np.where(df2.loc['mean'] >= 90, 'A0', 'B+'))

In [ ]:
df2